import React, { useState, useEffect } from 'react';
import { FaMoon, FaSun } from 'react-icons/fa';
import c1 from './Images/c1.jpg';
import c2 from './Images/c2.jpg';

export default function Safe_practices() {
  const [darkMode, setDarkMode] = useState(false);

  // Toggle dark mode
  const toggleDarkMode2 = () => {
    setDarkMode(!darkMode);
  };

  // Check localStorage for theme preference
  useEffect(() => {
    const savedTheme = localStorage.getItem('theme');
    if (savedTheme === 'dark') {
      setDarkMode(true);
    }
  }, []);

  // Store the theme preference
  useEffect(() => {
    if (darkMode) {
      localStorage.setItem('theme', 'dark');
    } else {
      localStorage.setItem('theme', 'light');
    }
  }, [darkMode]);

  return (
    <div>
      <div className={darkMode ? 'bg-gray-900 text-white min-h-screen' : 'bg-white text-black min-h-screen'}>
        <header className="flex justify-between items-center p-4 shadow-md">
          <h1 className="text-2xl font-bold">ආරක්ෂිත පිළිවෙත්</h1>
          <button
            onClick={toggleDarkMode2}
            className="text-2xl p-2 rounded-full focus:outline-none focus:ring-2 focus:ring-offset-2"
          >
            {darkMode ? <FaSun /> : <FaMoon />}
          </button>
        </header>
        <main className="p-6">
         <section className="mt-8">
             <h2 className="text-xl font-semibold mb-4 text-center">පෞද්ගලිකත්වය සහ රහස්‍යභාවය  </h2>
             <ul className="list-disc pl-5 mt-2 text-justify">
      <li>මූලික ලෙසම ඔබේ ලිංගික සහ ප්‍රජනක සෞඛ්‍යය පිළිබඳ පුද්ගලික තොරතුරු බෙදා ගැනීමේදී සැලකිලිමත් විය යුතුය. එනම් පෞද්ගලිකත්වයට සහ චිත්තවේගීය යහපැවැත්මට ගරු කරන සමීප මිතුරන්, පවුලේ සාමාජිකයන් හෝ හවුල්කරුවන් වැනි විශ්වාසවන්ත පුද්ගලයන්ට පමණක් එවැනි තොරතුරු හෙළි කරන්න. </li>
      <li>ප්‍රජනන සෞඛ්‍යය පිළිබදව වෘත්තීය සහාය ලබා ගැනීමේදී රහස්‍යතා ප්‍රතිපත්තිවලට බැඳී සිටින සුදුසුකම් ලත් සෞඛ්‍ය සේවා වෘත්තිකයන් හෝ උපදේශකයින් මත පිහිටා කටයුතු කිරීම වඩාත් සුරක්ෂිත වේ. මෙය ඔබගේ පුද්ගලික තොරතුරු සුරක්ෂිතව පවතින බව සහතික කරන අතර ඔබේ කැමැත්තෙන් තොරව බෙදා නොගනී. </li>
      <li>ප්‍රජකන සෞඛ්‍යය පිළිබදව උපදේශන සේවා ලබා ගැනීමේදී රහස්‍ය උපදේශන සේවා මගින් ඔබේ පෞද්ගලිකත්වය පවත්වා ගැනීමට චිත්තවේගීය සහය ලබා දෙයි. ඔබ ආතතිය, සම්බන්ධතා ගැටළු හෝ සෞඛ්‍ය ගැටළු සමඟ කටයුතු කළත්, මෙම ආරක්ෂිත අවකාශයන් ඔබව විවෘතව ප්‍රකාශ කිරීමට සහ විසඳුම් සෙවීමට ඔබට ශක්‍යතාවය ලබා දෙයි. </li>

    </ul>
<br></br>
    <h2 className="text-xl font-semibold mb-4 text-center ">චිත්තවේගීය සහ මානසික යහපැවැත්ම  </h2>
             <ul className="list-disc pl-5 mt-2 text-justify">
      <li>ලිංගික සහ ප්‍රජනක සෞඛ්‍ය ගැටලු කරණ කොට ගනිමින් මානසික ආතතිය හා කාංසාව වැනි රෝගී තත්ත්වයන් ඇති විය හැක. මෙම රෝගී තත්ත්වයන්ගෙන් මිදී ඵලදායී ලෙස ජීවත්වීමට විශ්වාසවන්ත පුද්ගලයන්, මානසික සෞඛ්‍ය වෘත්තිකයන් හෝ උපදේශකයින්ගෙන් සහය ලබා ගනිමින් ආතතිය කළමණාකරණය කිරීම අත්‍යාවශ්‍ය වේ. </li>
      <li>සියලුම ලිංගික ක්‍ර ියාකාරකම් සදහා සම්මුතියක් පැවතිය යුතුය. එනම් සෑම ලිංගික ක්‍ර ියාකාරකමක් සදහාම කැමැත්තට ප්‍රමුඛත්වය ලබා දීම වැදගත් වේ. පුද්ගලික සීමාවන් අවබෝධ කර ගැනීම සහ ඒවාට ගරු කිරීම සෞඛ්‍ය සම්පන්න සබඳතා වර්ධනය කිරීමට උපකාරී වන අතර චිත්තවේගීය පීඩාවන් අවම කිරීමට සමත් වේ. </li>
      <li>මූලික ලෙසම තමන් පවත්වන්නා වූ සබඳතාවල චිත්තවේගීය බලපෑම හඳුනා ගැනීම අනිවාය වේ. එනම් තම ස්වයං රැකවරණය සාක්ෂාත් කොට ගත හැක.</li>

    </ul>

<br></br>

<h2 className="text-xl font-semibold mb-4 text-center ">අපයෝජනය හඳුනා ගැනීම සහ ඒවා ආමන්ත්‍රණය කිරීම </h2>
             <ul className="list-disc pl-5 mt-2 text-justify">
      <li>ශාරීරික හානි ඇතුළු චිත්තවේගීය, ශාරීරික සහ ලිංගික අපයෝජනයන් පිළිබඳව දැනුවත් වීම මගින් ලිංගික ප්‍රජනක සෞඛ්‍යය සුරක්ෂිත කොට ගත හැක. ඔබේ මානසික සහ චිත්තවේගීය සෞඛ්‍යයට අහිතකර ලෙස බලපාන විෂ සම්බන්ධතා රටා හඳුනා ගන්න. </li>
      <li>අපයෝජනයක් හදුනා ගත්විට මඟ පෙන්වීම, උපදේශනය සහ ආරක්ෂාව සඳහා විශ්වාසවන්ත පුද්ගලයන්, වෘත්තිකයන් හෝ ආධාරක සංවිධාන වෙත ළඟා වන්න. එනම් ඔබ හදිසි අනතුරක සිටී නම්, සහාය සඳහා බලධාරීන් හෝ හදිසි සේවා අමතන්න.</li>
      <li>ගෞරවනීය, සෞඛ්‍ය සම්පන්න සබඳතා ප්‍රවර්ධනය කිරීම සහ අපයෝජනය අත්විඳින අන් අයට සහාය වීම. විවෘත සංවාද සහ දැනුවත් කිරීම් නිශ්ශබ්දතාවය බිඳීමට සහ ආරක්ෂිත, අවබෝධයෙන් යුත් ප්‍රජාවක් ගොඩනැගීමට උපකාරී වේ.</li>

    </ul>
    <br></br>
             <br></br><div className="flex justify-center items-center">
           <img
             src={c1}
             alt="Illustration"
             className="rounded-lg shadow-md max-w-[200px] max-h-[200px]"
           />
         </div>
<br></br>

<h2 className="text-xl font-semibold mb-4 text-center ">ප්‍රජා සහභාගීත්වය සහ ආරක්ෂිත පරිසරයක් නිර්මාණය කිරීම</h2>
             <ul className="list-disc pl-5 mt-2 text-justify">
      <li>ලිංගික සෞඛ්‍යය, මානසික සෞඛ්‍යය සහ සම්බන්ධතා අධ්‍යාපනය කෙරෙහි අවධානය යොමු කරන ලද උපකාරක කණ්ඩායම්, වැඩමුළු හෝ අධ්‍යාපන සැසිවල නියැලීමෙන් වටිනා තොරතුරු සහ චිත්තවේගීය සහය සැපයිය හැකිය. මෙම අවකාශයන් පුද්ගලයන්ට සෞඛ්‍ය සම්පන්න සබඳතා, ස්වයං රැකවරණ පිළිවෙත් සහ ආතතිය කළමනාකරණය කිරීමේ උපාය මාර්ග පිළිබඳව ඉගෙන ගැනීමට ඉඩ සලසයි. </li>
      <li>ආරක්ෂිත පරිසරයන් යනු මූලික ලෙසම  නිවසේ, රැකියා ස්ථානයේ, පාසල්වල හෝ ප්‍රජා මධ්‍යස්ථානවල වේවා එක් එක් පුද්ගලයන්ට චිත්තවේගීය වශයෙන් සුරක්ෂිතභාවයක්, ගෞරවයක් සහ අපකීර්තියකින් හෝ විනිශ්චයෙන් නිදහස් බවක් දැනෙන අවකාශයන් වේ. එවැනි පරිසරයන් ලැජ්ජාවට හෝ වෙනස් කොට සැලකීමට බිය නොවී ලිංගික හා මානසික සෞඛ්‍යය පිළිබඳ විවෘත සංවාදයන් දිරිමත් කරයි.</li>
      <li>ප්‍රජාව විසින් මෙහෙයවනු ලබන මුලපිරීම්වලට මනසේ සැසි, මානසික සෞඛ්‍ය පරීක්‍ෂණ, හෝ සම වයස් උපදේශන වැඩසටහන් වැනි ක්‍රියාකාරකම් ඇතුළත් විය හැකි අතර, ඒවා මිනිසුන්ට මුහුණ දීමේ කුසලතා වර්ධනය කිරීමට සහ චිත්තවේගීය ඔරොත්තු දීමේ හැකියාව වැඩි දියුණු කිරීමට උපකාරී වේ. </li>

    </ul>

<br></br>

<h2 className="text-xl font-semibold mb-4 text-center ">ලිංගික ප්‍රජනක සෞඛ්‍යයට අදාළ සෞඛ්‍ය සේවා වෙත ප්‍රවේශ වීම</h2>
             <ul className="list-disc pl-5 mt-2 text-justify">
      <li>ලිංගික සහ ප්‍රජනක සෞඛ්‍යය පවත්වා ගැනීම සඳහා සෞඛ්‍ය සේවා සපයන්නන් වෙත නිරන්තර පරීක්ෂණ මගින් උපලේඛනගත කිරීම අත්‍යවශ්‍ය වේ. එනම් පැප් පරීක්‍ෂණ, ලිංගාශ්‍ර ිත රෝග පරීක්‍ෂාව සහ පියයුරු හෝ පුරස්ථි ග්‍රන්ථි පරීක්‍ෂාව වැනි නිතිපතා පරීක්‍ෂා කිරීම් මගින් සෞඛ්‍ය ගැටලු කල්තියා හඳුනා ගැනීමට උපකාර වන අතර, ඵලදායී ප්‍රතිකාර සහ වැළැක්වීමේ අවස්ථා වැඩි කරයි.</li>
      <li>නිතිපතා පරීක්ෂා කිරීම් අක්‍රමවත් ඔසප් චක්‍ර, වඳභාවය පිළිබඳ ගැටළු හෝ ලිංගික සෞඛ්‍යයේ වෙනස්වීම් වැනි ගැටළු විසඳීමට අවස්ථාවක් සපයයි. සෞඛ්‍ය සේවා වෘත්තිකයන්ට ඔබේ වෛද්‍ය ඉතිහාසය සහ ජීවන රටාව මත පදනම්ව පුද්ගලාරෝපිත මග පෙන්වීමක් ලබා දිය හැක. </li>
      <li>පවුල් සැලසුම් සායන මගින් උපත් පාලන විකල්ප (පෙති, බද්ධ කිරීම් යනාදිය), සශ්‍රීකත්වය පිළිබඳ උපදෙස් සහ ගර්භණී උපදේශන ඇතුළුව ප්‍රජනක සෞඛ්‍යයට අදාළ පුළුල් පරාසයක සේවාවන් සපයයි. පුද්ගලයන්ගේ සහ පවුල්වල අනන්‍ය අවශ්‍යතා සපුරාලීම සඳහා මෙම සේවාවන් සකස් කර ඇත. </li>
      <li>සෞඛ්‍ය සේවාවට ප්‍රවේශ වීම ඇතුළත් විය යුතු අතර, සියලු ස්ත්‍රී පුරුෂ භාවය, ලිංගික දිශානතිය සහ සමාජ ආර්ථික පසුබිම්වල පුද්ගලයන්ට ගෞරවනීය සහ සුදුසු රැකවරණයක් ලැබෙන බව සහතික කළ යුතුය. අපකීර්තියට හෝ විනිශ්චයට බිය නොවී තම සෞඛ්‍ය ගැටලු සාකච්ඡා කිරීමට පුද්ගලයන්ට පහසුවක් දැනෙන පිළිගැනීමේ පරිසරයක් පහසුකම් ප්‍රවර්ධනය කළ යුතුය.</li>
   <br></br>
      <div className="flex flex-col justify-center items-center">
  <div className="flex justify-center items-center mb-4">
    <img
      src={c2}
      alt="Illustration of a Pap Test"
      className="rounded-lg shadow-md max-w-[200px] max-h-[200px]"
    />
  </div>
  <p className="text-center text-sm text-gray-600">
    Pap tests 
  </p>
</div>


    </ul>
    <br></br>
         
           </section>
        </main>
      </div>
    </div>
  );
}
